List<Map<String, dynamic>> messages = [
  {
    'message': 'سلام، من دوچرخه‌ای دارم که می‌خواهم بفروشم. هنوز نو هست و قیمت خوبی هم می‌دهم.',
    'yourOwnMessage': true,
    'date': '08:30:00'
  },
  {
    'message': 'سلام، می‌توانید تصاویری از دوچرخه بفرستید؟ و قیمت پیشنهادی شما چقدر است؟',
    'yourOwnMessage': false,
    'date': '08:31:00'
  },
  {
    'message': 'بله، البته. تصاویر را برایتان می‌فرستم. قیمت پیشنهادی من ۵۰۰ هزار تومان است.',
    'yourOwnMessage': true,
    'date': '08:32:00'
  },
  {
    'message': 'ممنون، دوچرخه خیلی خوب به نظر می‌رسد. آیا امکان مذاکره برای قیمت وجود دارد؟',
    'yourOwnMessage': false,
    'date': '08:33:00'
  },
  {
    'message': 'ممنون از شما. بله، می‌توانیم در مورد قیمت صحبت کنیم. شما چه قیمتی را پیشنهاد می‌دهید؟',
    'yourOwnMessage': true,
    'date': '08:34:00'
  },
  {
    'message': 'آیا ۴۵۰ هزار تومان مناسب است؟',
    'yourOwnMessage': false,
    'date': '08:35:00'
  },
  {
    'message': 'می‌توانم تا ۴۷۰ هزار تومان پایین بیایم. این قیمت برای شما مناسب است؟',
    'yourOwnMessage': true,
    'date': '08:36:00'
  },
  {
    'message': 'بله، این قیمت منصفانه به نظر می‌رسد. چطور می‌توانیم معامله را نهایی کنیم؟',
    'yourOwnMessage': false,
    'date': '08:37:00'
  },
];
